from openpecha.pecha.parsers.pedurma import parse, get_text_resource


def test_get_text_resource():
    pedurma_hfml_text = """༄། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་བཞུགས་སོ།།
༄༅༅། །རྒྱ་གར་སྐད་དུ། བོ་(༢) <«པེ་»བོད་>དྷི་སཏྭ་ཙརྱ་(༣) <«པེ་»ཙམླཻ་«སྣར་»ཙརྱྭ་>ཨ་བ་ཏཱ་ར། བོད་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ།
ཐམས་ཅད་བོར་ཏེ་:ཆས་དགོས་པར།(༡) <«པེ་»«སྣར་»ཆ་དགོས་པས།> ལོག་པའི་ལམ་ལས་སེམས་བླན་(༩) <«པེ་»གླ་«སྣར་»གླན་«སྡེ་»བླ་«ཅོ་»བླུན་>ཏེ།
"""
    expected_text_resouce = """༄། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་བཞུགས་སོ།།
༄༅༅། །རྒྱ་གར་སྐད་དུ། བོ་དྷི་སཏྭ་ཙརྱ་ཨ་བ་ཏཱ་ར། བོད་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ།
ཐམས་ཅད་བོར་ཏེ་ཆས་དགོས་པར། ལོག་པའི་ལམ་ལས་སེམས་བླན་ཏེ།
"""
    assert get_text_resource(pedurma_hfml_text) == expected_text_resouce

def test_pedurma_parser():
    pedurma_hfml_text = """༄། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་བཞུགས་སོ།།
༄༅༅། །རྒྱ་གར་སྐད་དུ། བོ་(༢) <«པེ་»བོད་>དྷི་སཏྭ་ཙརྱ་(༣) <«པེ་»ཙམླཻ་«སྣར་»ཙརྱྭ་>ཨ་བ་ཏཱ་ར། བོད་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ།
ཐམས་ཅད་བོར་ཏེ་:ཆས་དགོས་པར།(༡) <«པེ་»«སྣར་»ཆ་དགོས་པས།> ལོག་པའི་ལམ་ལས་སེམས་བླན་(༩) <«པེ་»གླ་«སྣར་»གླན་«སྡེ་»བླ་«ཅོ་»བླུན་>ཏེ།
"""
    expected_annotation_store = {

    }

    annotation_store = parse(pedurma_hfml_text)
    
    assert annotation_store == expected_annotation_store